app/Http/Controllers/HomeController.php

    public function index()
    {
                $times = Booking::query()
                    ->whereHas('device.operating_system', function ($query) {
                        $query->where('operating_systems.name', 'iOS');
                    })
        // //            ->join('devices', 'bookings.device_id', '=', 'devices.id')
        // //            ->join('operating_systems', 'devices.operating_system_id', '=', 'operating_systems.id')
        // //            ->where('operating_systems.name', 'iOS')
                    ->selectRaw('bookings.start_time, count(bookings.id) as bookings_count')
                    ->groupBy('start_time')
                    ->orderBy('bookings_count', 'desc')
                    ->take(5)
                    ->get();
---
select bookings.start_time, count(bookings.id) as bookings_count from `bookings` where exists (select * from `devices` where `bookings`.`device_id` = `devices`.`id` and exists (select * from `operating_systems` where `devices`.`operating_system_id` = `operating_systems`.`id` and `operating_systems`.`name` = 'iOS')) group by `start_time` order by `bookings_count` desc limit 5